//
//  main.swift
//  Homework 5
//
//  Created by Liana Asatryan on 05.05.22.
//

import Foundation

print("Hello, World!")

//Home Work 5 (Switch, Array)

//Homework 5_1

// Հայտարարել հաստատուն a Int տիպի (a = 2390)
//switch case կոնստռուկցիայի միջոցով տպեք a հաստատունի նիշերի քանակը (դիտարկել մինչև 7 նիշը և դրական թվերը default դեպքում տպել որ նշված թվի թվանշաների քանակը մեծ է 7 -ից  )
//հուշում օգտագործել 1…9 Range-ը։





//Home Work 5_2
//Հայտարարել փոփոխական a Int տիպի։
//a - ի արժեքը պետք է ընկաց լինի 0-ից - 9:
//ստուգել եթե a - ի արժեքը մեծ է  10 -ից վերագրել  a - ին 10, իսկ եթե փոքր է 0-ից վերագրել 0:

//Home Work 5_3
//Հայտարարել փոփոխական a Int տիպի։
//a - ի արժեքը պետք է ընկաց լինի 0-ից - 9:
//ստուգել եթե a - ի արժեքը մեծ է  10 -ից վերագրել  a - ին 10, իսկ եթե փոքր է 0-ից վերագրել 0:
//switch case կոնստռուկցիայի միջոցով տպեք a թվի տեկստային տարբերակը օրինակ եթե a = 4 պետք է տպել “Four”

//Home Work 5_4
//Հայտարարել հաստատուն  point tuple տիպի (x: 10, y: 20) և փոփոխական a = 0
//switch case կոնստռուկցիայի միջոցով ստուգել հետևյալ  դեպքերը
//եթե x < y a-ի արժեքին գումարել 1
//եթե x > y a-ի արժեքից հանել 1

//Home Work 5_5
//Հայտարարել հաստատուն  point tuple տիպի (x: 10, y: 20) և փոփոխական a = 0
//switch case կոնստռուկցիայի միջոցով ստուգել հետևյալ  դեպքերը
//եթե x-ը մեծ է y-ից 10-ով ապա a-ի արժեքին գումարել 1
//եթե x-ը փոքր է y-ից 10-ով  ապա a-ի արժեքից հանել 1

//Home Work 5_6
//Հայտարարել հաստատուն  point tuple տիպի (x: 10, y: 20) և փոփոխական a = 0
//switch case կոնստռուկցիայի միջոցով ստուգել հետևյալ  դեպքերը
//եթե x == 0  ապա a-ի արժեքին գումարել 1
//եթե y == 0  ապա a-ի արժեքից հանել 1
//եթե x == 10 և y == 20 ապա a-ի արժեքին գումարել 3



//Home Work 5_7
//Հայտարարել հաստատուն  a [Int] տիպի հետևևայ արժեքներով [1, 4, 5, 7, 0, -5]
//տպել մասիվի վերջին էլեմենտը ՝ բոլոր այն տարբերակներով որորնցով կարելի է

//Home Work 5_8
//Հայտարարել փոփոխական  a [Int] տիպի հետևևայ արժեքներով [1, 4, 5, 7, 0, -5]
//փոխել մասիվի առաջին էլեմենտի արժեքը 20-ի

//Home Work 5_9
//Հայտարարել փոփոխական  a [Int] տիպի հետևևայ արժեքներով [1, 4, 5, 7, 0, -5]
//ավելացնել 10 արժեքը մասիվի վերջում  ՝ բոլոր այն տարբերակներով որորնցով կարելի է։

//Home Work 5_10
//Հայտարարել փոփոխական  a [String] տիպի հետևևայ արժեքներով [“Hello”, “iOS”, “GITC”]
//տպել մասիվի մեջտեղում գտնվող էլեմենտի մեջտեղում գտնվող սինվոլը եթե այն դատարկ չէ
